PAndas is a DataScience tool to process and manipulate data


# Pandas in python

There are two types of data set's in pandas
<br>
<br>
1.SERIES->1D dataframe
<br>
<br>
2.Data Frame -> 2D data

# Series Data set

In [181]:
import pandas as pd#importing pandas module for data preprocessing
import numpy as np #importing numpy module for array processing

In [182]:
s = pd.Series([1,3,5,np.nan,6,8]) #np.nan stands for missing values
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [183]:
st_name = ['one','two','three',np.nan,'four','five']

In [184]:
st_name = pd.Series(st_name)

In [185]:
st_name
st_name[4]

'four'

In [186]:
print(dir(st_name))

['T', '_AXIS_ALIASES', '_AXIS_IALIASES', '_AXIS_LEN', '_AXIS_NAMES', '_AXIS_NUMBERS', '_AXIS_ORDERS', '_AXIS_REVERSED', '_AXIS_SLICEMAP', '__abs__', '__add__', '__and__', '__array__', '__array_prepare__', '__array_priority__', '__array_wrap__', '__bool__', '__bytes__', '__class__', '__contains__', '__copy__', '__deepcopy__', '__delattr__', '__delitem__', '__dict__', '__dir__', '__div__', '__divmod__', '__doc__', '__eq__', '__finalize__', '__float__', '__floordiv__', '__format__', '__ge__', '__getattr__', '__getattribute__', '__getitem__', '__getstate__', '__gt__', '__hash__', '__iadd__', '__imul__', '__init__', '__init_subclass__', '__int__', '__invert__', '__ipow__', '__isub__', '__iter__', '__itruediv__', '__le__', '__len__', '__long__', '__lt__', '__mod__', '__module__', '__mul__', '__ne__', '__neg__', '__new__', '__nonzero__', '__or__', '__pow__', '__radd__', '__rand__', '__rdiv__', '__reduce__', '__reduce_ex__', '__repr__', '__rfloordiv__', '__rmod__', '__rmul__', '__ror__', '__round__', '__rpow__', '__rsub__', '__rtruediv__', '__rxor__', '__setattr__', '__setitem__', '__setstate__', '__sizeof__', '__str__', '__sub__', '__subclasshook__', '__truediv__', '__unicode__', '__weakref__', '__xor__', '_accessors', '_add_numeric_operations', '_add_series_only_operations', '_add_series_or_dataframe_operations', '_agg_by_level', '_agg_doc', '_aggregate', '_aggregate_multiple_funcs', '_align_frame', '_align_series', '_allow_index_ops', '_at', '_binop', '_box_item_values', '_builtin_table', '_can_hold_na', '_check_inplace_setting', '_check_is_chained_assignment_possible', '_check_percentile', '_check_setitem_copy', '_clear_item_cache', '_clip_with_scalar', '_consolidate', '_consolidate_inplace', '_construct_axes_dict', '_construct_axes_dict_for_slice', '_construct_axes_dict_from', '_construct_axes_from_arguments', '_constructor', '_constructor_expanddim', '_constructor_sliced', '_convert', '_create_indexer', '_cython_table', '_dir_additions', '_dir_deletions', '_expand_axes', '_from_axes', '_get_axis', '_get_axis_name', '_get_axis_number', '_get_axis_resolvers', '_get_block_manager_axis', '_get_bool_data', '_get_cacher', '_get_index_resolvers', '_get_item_cache', '_get_numeric_data', '_get_values', '_get_values_tuple', '_get_with', '_gotitem', '_iat', '_iget_item_cache', '_iloc', '_index', '_indexed_same', '_info_axis', '_info_axis_name', '_info_axis_number', '_init_mgr', '_internal_names', '_internal_names_set', '_is_builtin_func', '_is_cached', '_is_cython_func', '_is_datelike_mixed_type', '_is_mixed_type', '_is_numeric_mixed_type', '_is_view', '_ix', '_ixs', '_loc', '_make_cat_accessor', '_make_dt_accessor', '_make_str_accessor', '_maybe_cache_changed', '_maybe_update_cacher', '_metadata', '_needs_reindex_multi', '_obj_with_exclusions', '_protect_consolidate', '_reduce', '_reindex_axes', '_reindex_axis', '_reindex_indexer', '_reindex_multi', '_reindex_with_indexers', '_repr_data_resource_', '_repr_latex_', '_reset_cache', '_reset_cacher', '_selected_obj', '_selection', '_selection_list', '_selection_name', '_set_as_cached', '_set_axis', '_set_axis_name', '_set_is_copy', '_set_item', '_set_labels', '_set_name', '_set_subtyp', '_set_values', '_set_with', '_set_with_engine', '_setup_axes', '_shallow_copy', '_slice', '_stat_axis', '_stat_axis_name', '_stat_axis_number', '_try_aggregate_string_function', '_typ', '_unpickle_series_compat', '_update_inplace', '_validate_dtype', '_values', '_where', '_xs', 'abs', 'add', 'add_prefix', 'add_suffix', 'agg', 'aggregate', 'align', 'all', 'any', 'append', 'apply', 'argmax', 'argmin', 'argsort', 'as_blocks', 'as_matrix', 'asfreq', 'asobject', 'asof', 'astype', 'at', 'at_time', 'autocorr', 'axes', 'base', 'between', 'between_time', 'bfill', 'blocks', 'bool', 'clip', 'clip_lower', 'clip_upper', 'combine', 'combine_first', 'compound', 'compress', 'consolidate', 'convert_objects', 'copy', 'corr', 'count', 'cov', 'cummax', 'cummin', 'cumprod', 'cumsum', 'data', 'describe', 'diff', 'div', 'divide', 'dot', 'drop', 'drop_duplicates', 'dropna', 'dtype', 'dtypes', 'duplicated', 'empty', 'eq', 'equals', 'ewm', 'expanding', 'factorize', 'ffill', 'fillna', 'filter', 'first', 'first_valid_index', 'flags', 'floordiv', 'from_array', 'from_csv', 'ftype', 'ftypes', 'ge', 'get', 'get_dtype_counts', 'get_ftype_counts', 'get_value', 'get_values', 'groupby', 'gt', 'hasnans', 'head', 'hist', 'iat', 'idxmax', 'idxmin', 'iloc', 'imag', 'index', 'interpolate', 'is_copy', 'is_monotonic', 'is_monotonic_decreasing', 'is_monotonic_increasing', 'is_unique', 'isin', 'isnull', 'item', 'items', 'itemsize', 'iteritems', 'ix', 'keys', 'kurt', 'kurtosis', 'last', 'last_valid_index', 'le', 'loc', 'lt', 'mad', 'map', 'mask', 'max', 'mean', 'median', 'memory_usage', 'min', 'mod', 'mode', 'mul', 'multiply', 'name', 'nbytes', 'ndim', 'ne', 'nlargest', 'nonzero', 'notnull', 'nsmallest', 'nunique', 'pct_change', 'pipe', 'plot', 'pop', 'pow', 'prod', 'product', 'ptp', 'put', 'quantile', 'radd', 'rank', 'ravel', 'rdiv', 'real', 'reindex', 'reindex_axis', 'reindex_like', 'rename', 'rename_axis', 'reorder_levels', 'repeat', 'replace', 'resample', 'reset_index', 'reshape', 'rfloordiv', 'rmod', 'rmul', 'rolling', 'round', 'rpow', 'rsub', 'rtruediv', 'sample', 'searchsorted', 'select', 'sem', 'set_axis', 'set_value', 'shape', 'shift', 'size', 'skew', 'slice_shift', 'sort_index', 'sort_values', 'sortlevel', 'squeeze', 'std', 'str', 'strides', 'sub', 'subtract', 'sum', 'swapaxes', 'swaplevel', 'tail', 'take', 'to_clipboard', 'to_csv', 'to_dense', 'to_dict', 'to_excel', 'to_frame', 'to_hdf', 'to_json', 'to_latex', 'to_msgpack', 'to_period', 'to_pickle', 'to_sparse', 'to_sql', 'to_string', 'to_timestamp', 'to_xarray', 'tolist', 'transform', 'transpose', 'truediv', 'truncate', 'tshift', 'tz_convert', 'tz_localize', 'unique', 'unstack', 'update', 'valid', 'value_counts', 'values', 'var', 'view', 'where', 'xs']

In [187]:
print(help(st_name.plot))

Help on SeriesPlotMethods in module pandas.plotting._core object:

class SeriesPlotMethods(BasePlotMethods)
 |  Series plotting accessor and method
 |
 |  Examples
 |  --------
 |  >>> s.plot.line()
 |  >>> s.plot.bar()
 |  >>> s.plot.hist()
 |
 |  Plotting methods can also be accessed by calling the accessor as a method
 |  with the ``kind`` argument:
 |  ``s.plot(kind='line')`` is equivalent to ``s.plot.line()``
 |
 |  Method resolution order:
 |      SeriesPlotMethods
 |      BasePlotMethods
 |      pandas.core.base.PandasObject
 |      pandas.core.base.StringMixin
 |      builtins.object
 |
 |  Methods defined here:
 |
 |  __call__(self, kind='line', ax=None, figsize=None, use_index=True, title=None, grid=None, legend=False, style=None, logx=False, logy=False, loglog=False, xticks=None, yticks=None, xlim=None, ylim=None, rot=None, fontsize=None, colormap=None, table=False, yerr=None, xerr=None, label=None, secondary_y=False, **kwds)
 |      Make plots of Series using matplotlib / pylab.
 |
 |      *New in version 0.17.0:* Each plot kind has a corresponding method on the
 |      ``Series.plot`` accessor:
 |      ``s.plot(kind='line')`` is equivalent to
 |      ``s.plot.line()``.
 |
 |      Parameters
 |      ----------
 |      data : Series
 |
 |      kind : str
 |          - 'line' : line plot (default)
 |          - 'bar' : vertical bar plot
 |          - 'barh' : horizontal bar plot
 |          - 'hist' : histogram
 |          - 'box' : boxplot
 |          - 'kde' : Kernel Density Estimation plot
 |          - 'density' : same as 'kde'
 |          - 'area' : area plot
 |          - 'pie' : pie plot
 |
 |      ax : matplotlib axes object
 |          If not passed, uses gca()
 |      figsize : a tuple (width, height) in inches
 |      use_index : boolean, default True
 |          Use index as ticks for x axis
 |      title : string or list
 |          Title to use for the plot. If a string is passed, print the string at
 |          the top of the figure. If a list is passed and `subplots` is True,
 |          print each item in the list above the corresponding subplot.
 |      grid : boolean, default None (matlab style default)
 |          Axis grid lines
 |      legend : False/True/'reverse'
 |          Place legend on axis subplots
 |      style : list or dict
 |          matplotlib line style per column
 |      logx : boolean, default False
 |          Use log scaling on x axis
 |      logy : boolean, default False
 |          Use log scaling on y axis
 |      loglog : boolean, default False
 |          Use log scaling on both x and y axes
 |      xticks : sequence
 |          Values to use for the xticks
 |      yticks : sequence
 |          Values to use for the yticks
 |      xlim : 2-tuple/list
 |      ylim : 2-tuple/list
 |      rot : int, default None
 |          Rotation for ticks (xticks for vertical, yticks for horizontal plots)
 |      fontsize : int, default None
 |          Font size for xticks and yticks
 |      colormap : str or matplotlib colormap object, default None
 |          Colormap to select colors from. If string, load colormap with that name
 |          from matplotlib.
 |      colorbar : boolean, optional
 |          If True, plot colorbar (only relevant for 'scatter' and 'hexbin' plots)
 |      position : float
 |          Specify relative alignments for bar plot layout.
 |          From 0 (left/bottom-end) to 1 (right/top-end). Default is 0.5 (center)
 |      layout : tuple (optional)
 |          (rows, columns) for the layout of the plot
 |      table : boolean, Series or DataFrame, default False
 |          If True, draw a table using the data in the DataFrame and the data will
 |          be transposed to meet matplotlib's default layout.
 |          If a Series or DataFrame is passed, use passed data to draw a table.
 |      yerr : DataFrame, Series, array-like, dict and str
 |          See :ref:`Plotting with Error Bars <visualization.errorbars>` for
 |          detail.
 |      xerr : same types as yerr.
 |      label : label argument to provide to plot
 |      secondary_y : boolean or sequence of ints, default False
 |          If True then y-axis will be on the right
 |      mark_right : boolean, default True
 |          When using a secondary_y axis, automatically mark the column
 |          labels with "(right)" in the legend
 |      kwds : keywords
 |          Options to pass to matplotlib plotting method
 |
 |      Returns
 |      -------
 |      axes : matplotlib.AxesSubplot or np.array of them
 |
 |      Notes
 |      -----
 |
 |      - See matplotlib documentation online for more on this subject
 |      - If `kind` = 'bar' or 'barh', you can specify relative alignments
 |        for bar plot layout by `position` keyword.
 |        From 0 (left/bottom-end) to 1 (right/top-end). Default is 0.5 (center)
 |
 |  area(self, **kwds)
 |      Area plot
 |
 |      .. versionadded:: 0.17.0
 |
 |      Parameters
 |      ----------
 |      **kwds : optional
 |          Keyword arguments to pass on to :py:meth:`pandas.Series.plot`.
 |
 |      Returns
 |      -------
 |      axes : matplotlib.AxesSubplot or np.array of them
 |
 |  bar(self, **kwds)
 |      Vertical bar plot
 |
 |      .. versionadded:: 0.17.0
 |
 |      Parameters
 |      ----------
 |      **kwds : optional
 |          Keyword arguments to pass on to :py:meth:`pandas.Series.plot`.
 |
 |      Returns
 |      -------
 |      axes : matplotlib.AxesSubplot or np.array of them
 |
 |  barh(self, **kwds)
 |      Horizontal bar plot
 |
 |      .. versionadded:: 0.17.0
 |
 |      Parameters
 |      ----------
 |      **kwds : optional
 |          Keyword arguments to pass on to :py:meth:`pandas.Series.plot`.
 |
 |      Returns
 |      -------
 |      axes : matplotlib.AxesSubplot or np.array of them
 |
 |  box(self, **kwds)
 |      Boxplot
 |
 |      .. versionadded:: 0.17.0
 |
 |      Parameters
 |      ----------
 |      **kwds : optional
 |          Keyword arguments to pass on to :py:meth:`pandas.Series.plot`.
 |
 |      Returns
 |      -------
 |      axes : matplotlib.AxesSubplot or np.array of them
 |
 |  density = kde(self, **kwds)
 |
 |  hist(self, bins=10, **kwds)
 |      Histogram
 |
 |      .. versionadded:: 0.17.0
 |
 |      Parameters
 |      ----------
 |      bins: integer, default 10
 |          Number of histogram bins to be used
 |      **kwds : optional
 |          Keyword arguments to pass on to :py:meth:`pandas.Series.plot`.
 |
 |      Returns
 |      -------
 |      axes : matplotlib.AxesSubplot or np.array of them
 |
 |  kde(self, **kwds)
 |      Kernel Density Estimate plot
 |
 |      .. versionadded:: 0.17.0
 |
 |      Parameters
 |      ----------
 |      **kwds : optional
 |          Keyword arguments to pass on to :py:meth:`pandas.Series.plot`.
 |
 |      Returns
 |      -------
 |      axes : matplotlib.AxesSubplot or np.array of them
 |
 |  line(self, **kwds)
 |      Line plot
 |
 |      .. versionadded:: 0.17.0
 |
 |      Parameters
 |      ----------
 |      **kwds : optional
 |          Keyword arguments to pass on to :py:meth:`pandas.Series.plot`.
 |
 |      Returns
 |      -------
 |      axes : matplotlib.AxesSubplot or np.array of them
 |
 |  pie(self, **kwds)
 |      Pie chart
 |
 |      .. versionadded:: 0.17.0
 |
 |      Parameters
 |      ----------
 |      **kwds : optional
 |          Keyword arguments to pass on to :py:meth:`pandas.Series.plot`.
 |
 |      Returns
 |      -------
 |      axes : matplotlib.AxesSubplot or np.array of them
 |
 |  ----------------------------------------------------------------------
 |  Methods inherited from BasePlotMethods:
 |
 |  __init__(self, data)
 |      Initialize self.  See help(type(self)) for accurate signature.
 |
 |  ----------------------------------------------------------------------
 |  Methods inherited from pandas.core.base.PandasObject:
 |
 |  __dir__(self)
 |      Provide method name lookup and completion
 |      Only provide 'public' methods
 |
 |  __sizeof__(self)
 |      Generates the total memory usage for a object that returns
 |      either a value or Series of values
 |
 |  __unicode__(self)
 |      Return a string representation for a particular object.
 |
 |      Invoked by unicode(obj) in py2 only. Yields a Unicode String in both
 |      py2/py3.
 |
 |  ----------------------------------------------------------------------
 |  Methods inherited from pandas.core.base.StringMixin:
 |
 |  __bytes__(self)
 |      Return a string representation for a particular object.
 |
 |      Invoked by bytes(obj) in py3 only.
 |      Yields a bytestring in both py2/py3.
 |
 |  __repr__(self)
 |      Return a string representation for a particular object.
 |
 |      Yields Bytestring in Py2, Unicode String in py3.
 |
 |  __str__(self)
 |      Return a string representation for a particular Object
 |
 |      Invoked by str(df) in both py2/py3.
 |      Yields Bytestring in Py2, Unicode String in py3.
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors inherited from pandas.core.base.StringMixin:
 |
 |  __dict__
 |      dictionary for instance variables (if defined)
 |
 |  __weakref__
 |      list of weak references to the object (if defined)

None

In [188]:
st_name.to_excel('stu.xls')

# <h1 style='color:#123456'>Data-Frame Data Set</h1>

In [189]:
import datetime
print(dir(datetime))

['MAXYEAR', 'MINYEAR', '__builtins__', '__cached__', '__doc__', '__file__', '__loader__', '__name__', '__package__', '__spec__', 'date', 'datetime', 'datetime_CAPI', 'time', 'timedelta', 'timezone', 'tzinfo']

In [190]:
dates = pd.date_range('20180701',periods=8,freq="M") #dates in pandas
dates

DatetimeIndex(['2018-07-31', '2018-08-31', '2018-09-30', '2018-10-31',
               '2018-11-30', '2018-12-31', '2019-01-31', '2019-02-28'],
              dtype='datetime64[ns]', freq='M')

In [191]:
print(datetime.date(2018,7,17))
print(datetime.datetime(2018,7,17,3,45,56))
import time
print(time.ctime())
np.random.randn(4,8)

2018-07-17
2018-07-17 03:45:56
Fri Jul 20 18:01:02 2018

array([[ -1.89653724e+00,  -4.08405712e-01,  -5.81854738e-01,
          4.12833233e-01,  -2.11697245e-01,  -1.02804499e+00,
         -1.07768144e+00,  -1.84294909e-01],
       [  1.38123228e+00,  -4.63883361e-01,   1.36477363e+00,
         -6.70116774e-01,   7.48967301e-01,  -7.38225239e-01,
         -5.07168331e-01,   2.01236965e-01],
       [  7.50516904e-01,  -4.25962384e-01,  -1.31382090e+00,
          1.47494417e-03,  -7.53572525e-01,  -8.62865988e-01,
         -6.89351619e-03,  -1.18044162e+00],
       [  9.06963116e-01,  -1.40599613e+00,  -1.55163605e+00,
         -6.19682966e-01,  -6.01138950e-01,  -1.03550414e+00,
         -2.37891036e-01,  -7.11821148e-01]])

In [192]:
df = pd.DataFrame(np.random.randn(8,4),index=dates,columns=list('ABCD'))
df #dataframe with index as dates and columns as A B C D

                   A         B         C         D
2018-07-31 -0.917972  0.488715  1.059314 -0.690005
2018-08-31  2.315549  0.194446  0.738869  1.672729
2018-09-30 -0.908153 -0.032429 -1.720719  0.287418
2018-10-31 -0.600786  1.669938  1.132861 -1.556339
2018-11-30  0.912346 -1.381238  0.695607 -1.287041
2018-12-31  3.260355  2.111443  0.537954 -1.833123
2019-01-31 -0.819065 -1.769631  0.288281 -0.263280
2019-02-28 -0.232392  0.535340 -0.407491 -0.801823

In [193]:
df2 = pd.DataFrame({
    'A':1,
    'B':pd.Timestamp('20180715'),
    'C':pd.Series(1,index=list(range(4)),dtype='float32'),
    'D':np.array([3]*4,dtype='int32'),
    'E':pd.Categorical(["test","train","test",'train']),
    'F':'foo' ,
})
df2

   A          B    C  D      E    F
0  1 2018-07-15  1.0  3   test  foo
1  1 2018-07-15  1.0  3  train  foo
2  1 2018-07-15  1.0  3   test  foo
3  1 2018-07-15  1.0  3  train  foo

In [194]:
#All the columns resulting DataFrames have different data-types let's check it out
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

#<h1 style='color:#123456'>Viewing Data</h1><br /><br />

In [195]:
#top and bottom of the data set
df.head()#top and bottom of the data set
df.head()

                   A         B         C         D
2018-07-31 -0.917972  0.488715  1.059314 -0.690005
2018-08-31  2.315549  0.194446  0.738869  1.672729
2018-09-30 -0.908153 -0.032429 -1.720719  0.287418
2018-10-31 -0.600786  1.669938  1.132861 -1.556339
2018-11-30  0.912346 -1.381238  0.695607 -1.287041

In [196]:
df.tail(3)

                   A         B         C         D
2018-12-31  3.260355  2.111443  0.537954 -1.833123
2019-01-31 -0.819065 -1.769631  0.288281 -0.263280
2019-02-28 -0.232392  0.535340 -0.407491 -0.801823

In [197]:
st_names=['ram','shyam','kirti','hari','ghanshyam','rohan']
index = ['NAme','MAth','Science']
math=[60,80,78,98,67,67]
science=[56,67,78,90,98]
data = [st_names,math,science]

In [198]:
data

[['ram', 'shyam', 'kirti', 'hari', 'ghanshyam', 'rohan'],
 [60, 80, 78, 98, 67, 67],
 [56, 67, 78, 90, 98]]

In [199]:
df2= pd.DataFrame(data,index=index,columns=np.arange(6))

In [200]:
df2

           0      1      2     3          4      5
NAme     ram  shyam  kirti  hari  ghanshyam  rohan
MAth      60     80     78    98         67     67
Science   56     67     78    90         98   None

In [201]:
k=df2.T

In [202]:
k.describe()

         NAme  MAth  Science
count       6     6        5
unique      6     5        5
top     shyam    67       98
freq        1     2        1

In [203]:
k

        NAme MAth Science
0        ram   60      56
1      shyam   80      67
2      kirti   78      78
3       hari   98      90
4  ghanshyam   67      98
5      rohan   67    None

In [204]:
#Making datatype using dictionary
#keys will be considered as column and values will be considerd as values


df3 = pd.DataFrame({
    'A':1,
    'B':pd.Timestamp('20180715'),
    'C':pd.Series(1,index=list(range(4)),dtype='float32'),
    'D':np.array([3]*4,dtype='int32'),
    'E':pd.Categorical(["test","train","test",'train']),
    'F':'foo' ,
})
df3

   A          B    C  D      E    F
0  1 2018-07-15  1.0  3   test  foo
1  1 2018-07-15  1.0  3  train  foo
2  1 2018-07-15  1.0  3   test  foo
3  1 2018-07-15  1.0  3  train  foo

In [205]:
d={
    'username':['john','natasha','krish','root','harry'],
    'date':pd.date_range('20180918',periods=5,freq='D'),
    'password':['abc','dfgh','sdfgh','sdfgthy','sdefrgt']
}
df4=pd.DataFrame(d,index=range(1,6))
df4

        date password username
1 2018-09-18      abc     john
2 2018-09-19     dfgh  natasha
3 2018-09-20    sdfgh    krish
4 2018-09-21  sdfgthy     root
5 2018-09-22  sdefrgt    harry

In [206]:
df4.dtypes

date        datetime64[ns]
password            object
username            object
dtype: object

In [207]:
df4.tail(3)

        date password username
3 2018-09-20    sdfgh    krish
4 2018-09-21  sdfgthy     root
5 2018-09-22  sdefrgt    harry

In [208]:
df4.head(4)

        date password username
1 2018-09-18      abc     john
2 2018-09-19     dfgh  natasha
3 2018-09-20    sdfgh    krish
4 2018-09-21  sdfgthy     root

In [209]:
df4.index

RangeIndex(start=1, stop=6, step=1)

In [210]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [211]:
df4.describe()

                       date password username
count                     5        5        5
unique                    5        5        5
top     2018-09-20 00:00:00     dfgh    krish
freq                      1        1        1
first   2018-09-18 00:00:00      NaN      NaN
last    2018-09-22 00:00:00      NaN      NaN

In [212]:
df.describe()

              A         B         C         D
count  8.000000  8.000000  8.000000  8.000000
mean   0.376235  0.227073  0.290584 -0.558933
std    1.623262  1.332993  0.945608  1.134443
min   -0.917972 -1.769631 -1.720719 -1.833123
25%   -0.841337 -0.369632  0.114338 -1.354365
50%   -0.416589  0.341580  0.616780 -0.745914
75%    1.263147  0.818990  0.818981 -0.125605
max    3.260355  2.111443  1.132861  1.672729

In [213]:
df4

        date password username
1 2018-09-18      abc     john
2 2018-09-19     dfgh  natasha
3 2018-09-20    sdfgh    krish
4 2018-09-21  sdfgthy     root
5 2018-09-22  sdefrgt    harry

In [214]:
#to sort structure of table
#axis 1 is for column

df4.sort_index(axis=1,ascending=False)

  username password       date
1     john      abc 2018-09-18
2  natasha     dfgh 2018-09-19
3    krish    sdfgh 2018-09-20
4     root  sdfgthy 2018-09-21
5    harry  sdefrgt 2018-09-22

In [215]:
#to sort structure of table
#axis 0 is for row

df4.sort_index(axis=0,ascending=False)

        date password username
5 2018-09-22  sdefrgt    harry
4 2018-09-21  sdfgthy     root
3 2018-09-20    sdfgh    krish
2 2018-09-19     dfgh  natasha
1 2018-09-18      abc     john

In [216]:
#To sort values inside the table

df.sort_values(by='C',ascending=False)

                   A         B         C         D
2018-10-31 -0.600786  1.669938  1.132861 -1.556339
2018-07-31 -0.917972  0.488715  1.059314 -0.690005
2018-08-31  2.315549  0.194446  0.738869  1.672729
2018-11-30  0.912346 -1.381238  0.695607 -1.287041
2018-12-31  3.260355  2.111443  0.537954 -1.833123
2019-01-31 -0.819065 -1.769631  0.288281 -0.263280
2019-02-28 -0.232392  0.535340 -0.407491 -0.801823
2018-09-30 -0.908153 -0.032429 -1.720719  0.287418

# <h3 style='color:#345678'>Display the index, columns, and the underlying NumPy data</h3>

In [217]:
df.index

DatetimeIndex(['2018-07-31', '2018-08-31', '2018-09-30', '2018-10-31',
               '2018-11-30', '2018-12-31', '2019-01-31', '2019-02-28'],
              dtype='datetime64[ns]', freq='M')

In [218]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

# <h3 style='color:#345678'>describe() shows a quick statistic summary of your data:</h3>

In [219]:
df.describe()

              A         B         C         D
count  8.000000  8.000000  8.000000  8.000000
mean   0.376235  0.227073  0.290584 -0.558933
std    1.623262  1.332993  0.945608  1.134443
min   -0.917972 -1.769631 -1.720719 -1.833123
25%   -0.841337 -0.369632  0.114338 -1.354365
50%   -0.416589  0.341580  0.616780 -0.745914
75%    1.263147  0.818990  0.818981 -0.125605
max    3.260355  2.111443  1.132861  1.672729

# <h3 style='color:#56789a'>Transposing your data:</h3>

In [220]:
df.T

,2018-07-31 00:00:00,2018-08-31 00:00:00,2018-09-30 00:00:00,2018-10-31 00:00:00,2018-11-30 00:00:00,2018-12-31 00:00:00,2019-01-31 00:00:00,2019-02-28 00:00:00
A,-0.917972,2.315549,-0.908153,-0.600786,0.912346,3.260355,-0.819065,-0.232392
B,0.488715,0.194446,-0.032429,1.669938,-1.381238,2.111443,-1.769631,0.535340
C,1.059314,0.738869,-1.720719,1.132861,0.695607,0.537954,0.288281,-0.407491
D,-0.690005,1.672729,0.287418,-1.556339,-1.287041,-1.833123,-0.263280,-0.801823

#<h3 style='color:#56789a'>Sorting by an axis:</h3>

In [221]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2018-07-31 -0.690005  1.059314  0.488715 -0.917972
2018-08-31  1.672729  0.738869  0.194446  2.315549
2018-09-30  0.287418 -1.720719 -0.032429 -0.908153
2018-10-31 -1.556339  1.132861  1.669938 -0.600786
2018-11-30 -1.287041  0.695607 -1.381238  0.912346
2018-12-31 -1.833123  0.537954  2.111443  3.260355
2019-01-31 -0.263280  0.288281 -1.769631 -0.819065
2019-02-28 -0.801823 -0.407491  0.535340 -0.232392

# <h3 style='color:#56789a'>Sorting by an values:</h3>

In [222]:
df.sort_values(by='B',ascending=False)

                   A         B         C         D
2018-12-31  3.260355  2.111443  0.537954 -1.833123
2018-10-31 -0.600786  1.669938  1.132861 -1.556339
2019-02-28 -0.232392  0.535340 -0.407491 -0.801823
2018-07-31 -0.917972  0.488715  1.059314 -0.690005
2018-08-31  2.315549  0.194446  0.738869  1.672729
2018-09-30 -0.908153 -0.032429 -1.720719  0.287418
2018-11-30  0.912346 -1.381238  0.695607 -1.287041
2019-01-31 -0.819065 -1.769631  0.288281 -0.263280

In [223]:
k

        NAme MAth Science
0        ram   60      56
1      shyam   80      67
2      kirti   78      78
3       hari   98      90
4  ghanshyam   67      98
5      rohan   67    None

In [224]:
k1=k.iloc[:,1:4]

In [225]:
k1

  MAth Science
0   60      56
1   80      67
2   78      78
3   98      90
4   67      98
5   67    None

In [226]:
k1.describe()

        MAth  Science
count      6        5
unique     5        5
top       67       98
freq       2        1

In [227]:
k1.dtypes

MAth       object
Science    object
dtype: object

In [228]:
d={
    'name':['x','y','z','a','b'],
    'height':[5.5,5.6,5.8,4.11,6.2],
    'weight':[65,70,69,68,43],
    'dob':['01/01/1996','07/02,1997','09/06/1996','18/05/1999','23/12/1995']
}
data=pd.DataFrame(d,index=range(1,6))

In [229]:
data

          dob  height name  weight
1  01/01/1996    5.50    x      65
2  07/02,1997    5.60    y      70
3  09/06/1996    5.80    z      69
4  18/05/1999    4.11    a      68
5  23/12/1995    6.20    b      43

In [230]:
#intializing a series to add new column to database
salary=pd.Series([20000,25000,23500,40000,56000],index=[1,2,3,4,5])

In [231]:
salary

1    20000
2    25000
3    23500
4    40000
5    56000
dtype: int64

In [232]:
#Adding new column to data frame
data['salary']=salary

In [233]:
data

          dob  height name  weight  salary
1  01/01/1996    5.50    x      65   20000
2  07/02,1997    5.60    y      70   25000
3  09/06/1996    5.80    z      69   23500
4  18/05/1999    4.11    a      68   40000
5  23/12/1995    6.20    b      43   56000

In [234]:
#To change a particular column
data.loc[:,'height']=[5.7,5.1,5.10,5.1,6.4]

In [235]:
data

          dob  height name  weight  salary
1  01/01/1996     5.7    x      65   20000
2  07/02,1997     5.1    y      70   25000
3  09/06/1996     5.1    z      69   23500
4  18/05/1999     5.1    a      68   40000
5  23/12/1995     6.4    b      43   56000

In [236]:
data['height']

1    5.7
2    5.1
3    5.1
4    5.1
5    6.4
Name: height, dtype: float64

In [237]:
np.mean(data['height'])

5.4799999999999995

In [238]:
data['height']=np.mean(data['height'])

In [239]:
data

          dob  height name  weight  salary
1  01/01/1996    5.48    x      65   20000
2  07/02,1997    5.48    y      70   25000
3  09/06/1996    5.48    z      69   23500
4  18/05/1999    5.48    a      68   40000
5  23/12/1995    5.48    b      43   56000

In [240]:
data['weight'][data['weight'].isin(range(66))]

1    65
5    43
Name: weight, dtype: int64

In [241]:
data['weight'][data['weight'].isin(range(66))]

1    65
5    43
Name: weight, dtype: int64

In [242]:
data

          dob  height name  weight  salary
1  01/01/1996    5.48    x      65   20000
2  07/02,1997    5.48    y      70   25000
3  09/06/1996    5.48    z      69   23500
4  18/05/1999    5.48    a      68   40000
5  23/12/1995    5.48    b      43   56000

In [243]:
data

          dob  height name  weight  salary
1  01/01/1996    5.48    x      65   20000
2  07/02,1997    5.48    y      70   25000
3  09/06/1996    5.48    z      69   23500
4  18/05/1999    5.48    a      68   40000
5  23/12/1995    5.48    b      43   56000

In [244]:
data['weight'][data['weight'].isin(range(66))]=data['weight'][data['weight'].isin(range(66))]+10

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [245]:
data

          dob  height name  weight  salary
1  01/01/1996    5.48    x      75   20000
2  07/02,1997    5.48    y      70   25000
3  09/06/1996    5.48    z      69   23500
4  18/05/1999    5.48    a      68   40000
5  23/12/1995    5.48    b      53   56000

In [248]:
data.mean()

height        5.48
weight       67.00
salary    32900.00
dtype: float64

In [249]:
data.mean(1)

1     6693.493333
2     8358.493333
3     7858.160000
4    13357.826667
5    18686.160000
dtype: float64

In [256]:
data2=data.iloc[:,[1,3]]
data2

   height  weight
1    5.48      75
2    5.48      70
3    5.48      69
4    5.48      68
5    5.48      53

In [262]:
data2.apply(lambda x:np.std(x))

height    0.000000
weight    7.402702
dtype: float64